app/controllers/posts_controller.rb

  def index
    @posts = Post.order(id: :asc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC

  def create
    post = Post.create!(post_params)
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "新規投稿の検証"], ["content", "投稿した後どうなるか"], ["created_at", "2020-09-12 15:01:32.258724"], ["updated_at", "2020-09-12 15:01:32.258724"]]